[
  {
    "id": "25338U",
    "name": "NOAA 15",
    "tle1": "1 25338U 98030A   25102.82311881  .00000404  00000+0  18381-3 0  9994",
    "tle2": "2 25338  98.5409 129.3303 0010702 162.2760 197.8796 14.26939897400169",
    "category": "weather",
    "description": "Launched in 1998, this veteran weather satellite continues to deliver valuable atmospheric data after more than 25 years in orbit. NOAA 15's impressive longevity has provided meteorologists with a consistent long-term dataset, making it a cornerstone for climate change research while still contributing to daily weather forecasting worldwide.",
    "transponders": {
      "modes": [
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "137.620",
          "beacon": "",
          "mode": "Call sign"
        }
      ]
    },
    "image": "/images/satellites/weather/noaa15.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "28054U",
    "name": "DMSP 5D-3 F16 (USA 172)",
    "tle1": "1 28054U 03048A   25102.86547633  .00000304  00000+0  18295-3 0  9990",
    "tle2": "2 28054  99.0168 118.1702 0006120 287.9044 198.9760 14.14334020108637",
    "category": "weather",
    "description": "Launched in 2003, this military weather satellite exemplifies the crucial intersection of defense and meteorology. F16's specialized sensors provide vital cloud cover and precipitation data to military planners while simultaneously contributing to civilian weather models, demonstrating how national security and public safety concerns can be addressed by the same space asset.",
    "transponders": {},
    "image": "/images/satellites/weather/dmsp.jpg",
    "image_source": "https://space.skyrocket.de/",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "28654U",
    "name": "NOAA 18",
    "tle1": "1 28654U 05018A   25102.79384662  .00000422  00000+0  24693-3 0  9998",
    "tle2": "2 28654  98.8430 182.9182 0013066 294.7141  65.2672 14.13573233 25584",
    "category": "weather",
    "description": "Launched in 2005, this reliable weather sentinel has been tracking storms and monitoring environmental changes for nearly two decades. NOAA 18's suite of advanced instruments captures detailed images and atmospheric profiles used for hurricane tracking, sea ice monitoring, and climate studies, providing critical data that helps meteorologists protect lives and property worldwide.",
    "transponders": {
      "modes": [
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "137.9125",
          "beacon": "",
          "mode": "Call sign"
        }
      ]
    },
    "image": "/images/satellites/weather/noaa18.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "28912U",
    "name": "METEOSAT-9 (MSG-2)",
    "tle1": "1 28912U 05049B   25102.64368937  .00000133  00000+0  00000+0 0  9991",
    "tle2": "2 28912   8.3794  58.2364 0001154 348.7005  71.5762  1.00268740 70767",
    "category": "weather",
    "description": "Launched in 2005, this European weather watchkeeper maintains a constant vigil over Africa, Europe, and the Middle East from its geostationary perch. MSG-2's rapid-scan capabilities capture the birth and evolution of severe weather systems every 15 minutes, providing crucial early warnings for dangerous storms while contributing to our understanding of regional climate patterns.",
    "transponders": {},
    "image": "/images/satellites/weather/meteosat9.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/eu.png"
  },
  {
    "id": "29155U",
    "name": "EWS-G1 (GOES 13)",
    "tle1": "1 29155U 06018A   25102.55211508 -.00000144  00000+0  00000+0 0  9992",
    "tle2": "2 29155   3.4108  81.6544 0065525 264.1062 238.4039  0.98833649 38990",
    "category": "weather",
    "description": "Launched in 2006, this atmospheric sentinel began life as a civilian GOES satellite before being repurposed for military weather monitoring. After faithfully serving NOAA for years tracking hurricanes and severe storms over the Americas, it now continues its mission under a new designation, exemplifying how valuable weather satellites can find new purposes rather than face retirement.",
    "transponders": {},
    "image": "/images/satellites/weather/ewsg1.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "29522U",
    "name": "DMSP 5D-3 F17 (USA 191)",
    "tle1": "1 29522U 06050A   25102.86375720  .00000380  00000+0  21953-3 0  9992",
    "tle2": "2 29522  98.7414 113.2665 0009633 198.2174 161.8656 14.14810178951566",
    "category": "weather",
    "description": "Launched in 2006, this military weather observer combines national security with environmental monitoring in one sophisticated package. F17's microwave imaging and sounding suite can peer through clouds to detect precipitation patterns and sea ice extent, providing tactical weather intelligence to military operations while contributing valuable data to climate researchers studying polar ice changes.",
    "transponders": {},
    "image": "/images/satellites/weather/dmsp.jpg",
    "image_source": "https://space.skyrocket.de/",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "32958U",
    "name": "FENGYUN 3A",
    "tle1": "1 32958U 08026A   25102.79414545  .00000356  00000+0  18976-3 0  9999",
    "tle2": "2 32958  98.6434  47.8961 0007651 292.0586  67.9777 14.19417802874457",
    "category": "weather",
    "description": "Launched in 2008, this pioneering Chinese meteorological satellite marked a significant advancement in the country's weather observation capabilities. FY-3A's diverse array of 11 instruments measures everything from atmospheric temperature profiles to soil moisture, representing China's growing contribution to global weather forecasting networks while supporting the nation's ambitious disaster monitoring and prevention programs.",
    "transponders": {},
    "image": "/images/satellites/weather/fengyun3a.jpg",
    "image_source": "https://db.satnogs.org/",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "33591U",
    "name": "NOAA 19",
    "tle1": "1 33591U 09005A   25102.86167266  .00000390  00000+0  23189-3 0  9994",
    "tle2": "2 33591  99.0017 167.2316 0014237 163.1203 197.0445 14.13338278833956",
    "category": "weather",
    "description": "Launched in 2009, this final member of NOAA's legendary POES satellite series caps a weather monitoring legacy stretching back to 1978. NOAA 19's comprehensive instrument suite continues to deliver detailed atmospheric soundings and imagery that support weather forecasting worldwide, while also monitoring ozone depletion and space weather events that can impact our technology-dependent civilization.",
    "transponders": {
      "modes": [
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "137.100",
          "beacon": "",
          "mode": "Call sign"
        }
      ]
    },
    "image": "/images/satellites/weather/noaa19.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "35491U",
    "name": "GOES 14",
    "tle1": "1 35491U 09033A   25102.58538374 -.00000063  00000+0  00000+0 0  9998",
    "tle2": "2 35491   0.5653  88.7049 0000239  29.5156 185.2356  1.00270911  2273",
    "category": "weather",
    "description": "Launched in 2009, this vigilant weather sentinel patiently serves as an orbital backup, ready to spring into action when other satellites need maintenance or replacement. GOES 14's standby status exemplifies the redundancy built into critical weather monitoring infrastructure, ensuring continuous coverage of severe weather phenomena that could threaten lives and property across the Americas.",
    "transponders": {},
    "image": "/images/satellites/weather/goes14.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "35951U",
    "name": "DMSP 5D-3 F18 (USA 210)",
    "tle1": "1 35951U 09057A   25102.85905986  .00000580  00000+0  32463-3 0  9997",
    "tle2": "2 35951  98.8559  80.8957 0011933  39.0047 321.1985 14.14582828798721",
    "category": "weather",
    "description": "Launched in 2009, this military meteorological observer represents a critical link in the chain of weather satellites supporting national defense. F18's specialized sensors provide visibility through darkness and cloud cover, enabling military planners to anticipate weather conditions that might affect operations, while simultaneously contributing valuable data to global environmental monitoring and climate research efforts.",
    "transponders": {},
    "image": "/images/satellites/weather/dmsp.jpg",
    "image_source": "https://space.skyrocket.de/",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "36411U",
    "name": "EWS-G2 (GOES 15)",
    "tle1": "1 36411U 10008A   25102.54759079  .00000041  00000+0  00000+0 0  9993",
    "tle2": "2 36411   0.1603  86.2496 0002217 197.1404 176.0605  1.00274452 55325",
    "category": "weather",
    "description": "Launched in 2010, this adaptable weather satellite exemplifies how space assets can find new purposes throughout their operational lives. After years of dedicated service to NOAA monitoring weather patterns over the western United States and Pacific Ocean, GOES 15 has transitioned to supporting military weather forecasting, extending its valuable contribution to both civilian safety and national security missions.",
    "transponders": {},
    "image": "/images/satellites/weather/ewsg2.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "36744U",
    "name": "COMS 1",
    "tle1": "1 36744U 10032A   25102.48947729 -.00000339  00000+0  00000+0 0  9994",
    "tle2": "2 36744   3.7011  80.8295 0001070 307.1871 117.2672  1.00273504 46777",
    "category": "weather",
    "description": "Launched in 2010, this multifunctional South Korean satellite represented a significant advancement in the nation's space capabilities. COMS 1's three-in-one design combined weather monitoring, ocean observation, and experimental communications technology in a single platform, demonstrating how smaller space-faring nations can maximize the efficiency of their satellite programs while contributing to regional weather forecasting.",
    "transponders": {},
    "image": "/images/satellites/weather/coms1.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/south_korea.png"
  },
  {
    "id": "37214U",
    "name": "FENGYUN 3B",
    "tle1": "1 37214U 10059A   25102.88830495  .00000213  00000+0  13400-3 0  9993",
    "tle2": "2 37214  99.0197 140.6973 0021459 327.7602  79.2743 14.14712067746622",
    "category": "weather",
    "description": "Launched in 2010, this sophisticated Chinese weather satellite further expanded the country's growing meteorological monitoring capabilities. FY-3B's afternoon orbit complements its morning-orbit siblings, ensuring comprehensive daily coverage of atmospheric conditions, while its advanced instruments provide crucial data for weather forecasting, climate research, and environmental monitoring across Asia and beyond.",
    "transponders": {},
    "image": "/images/satellites/weather/fengyun3b.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "37849U",
    "name": "SUOMI NPP",
    "tle1": "1 37849U 11061A   25102.81405845  .00000221  00000+0  12566-3 0  9992",
    "tle2": "2 37849  98.7541  42.7327 0002427 104.2129 255.9316 14.19517631697377",
    "category": "weather",
    "description": "Launched in 2011, this groundbreaking satellite represented a crucial bridge between generations of weather monitoring technology. Named for meteorology pioneer Verner Suomi, NPP introduced advanced instruments that dramatically improved weather forecasting precision while ensuring continuity of climate data records during a transition period between satellite series, demonstrating forward-thinking program management in Earth observation.",
    "transponders": {},
    "image": "/images/satellites/weather/suominpp.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "38552U",
    "name": "METEOSAT-10 (MSG-3)",
    "tle1": "1 38552U 12035B   25102.60693007  .00000005  00000+0  00000+0 0  9998",
    "tle2": "2 38552   3.6550  62.0415 0001403 273.6378  84.4270  1.00280361 46530",
    "category": "weather",
    "description": "Launched in 2012, this vigilant European weather sentinel maintains a constant watch over Africa, Europe, and neighboring oceans from its geostationary vantage point. MSG-3's rapid-scan imagery captures the formation and movement of weather systems every 15 minutes, providing crucial early warnings for severe storms while supporting numerical weather prediction models that have revolutionized forecasting accuracy across multiple continents.",
    "transponders": {},
    "image": "/images/satellites/weather/meteosat10.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/eu.png"
  },
  {
    "id": "38771U",
    "name": "METOP-B",
    "tle1": "1 38771U 12049A   25102.81939738  .00000310  00000+0  16115-3 0  9990",
    "tle2": "2 38771  98.5831 158.6445 0001701 124.9096 235.2241 14.21476483652119",
    "category": "weather",
    "description": "Launched in 2012, this European polar orbiter represents a cornerstone of the global atmospheric monitoring network. METOP-B's sophisticated suite of instruments provides crucial vertical profiles of temperature and humidity that dramatically improve the accuracy of numerical weather prediction models, while simultaneously tracking ozone levels, monitoring solar radiation, and even relaying distress signals from ships and aircraft in trouble.",
    "transponders": {},
    "image": "/images/satellites/weather/metopb.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/eu.png"
  },
  {
    "id": "39216U",
    "name": "INSAT-3D",
    "tle1": "1 39216U 13038B   25102.56114411 -.00000336  00000+0  00000+0 0  9990",
    "tle2": "2 39216   0.8115  88.3269 0001500 263.0675 181.1176  1.00268963 42768",
    "category": "weather",
    "description": "Launched in 2013, this Indian meteorological powerhouse significantly enhanced weather forecasting capabilities across the subcontinent. INSAT-3D's advanced imager and sounder instruments provide crucial real-time data on developing monsoons, cyclones, and other weather phenomena affecting more than a billion people, while its data relay transponder connects automated weather stations across remote regions, creating a comprehensive monitoring network.",
    "transponders": {},
    "image": "/images/satellites/weather/insat3d.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/india.png"
  },
  {
    "id": "39260U",
    "name": "FENGYUN 3C",
    "tle1": "1 39260U 13052A   25102.90208482  .00000252  00000+0  14948-3 0  9991",
    "tle2": "2 39260  98.4525  92.8401 0014664 177.8546 182.2695 14.15603965597754",
    "category": "weather",
    "description": "Launched in 2013, this advanced Chinese meteorological satellite further expanded the nation's weather monitoring capabilities with next-generation technology. FY-3C's suite of 12 sophisticated instruments includes microwave sounders that can peer through clouds to measure atmospheric conditions below, significantly enhancing precipitation forecasts while contributing to China's growing role in international meteorological cooperation.",
    "transponders": {},
    "image": "/images/satellites/weather/fengyun3c.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "40069U",
    "name": "METEOR-M 2",
    "tle1": "1 40069U 14037A   25102.89339102  .00000344  00000+0  17711-3 0  9999",
    "tle2": "2 40069  98.4655  90.1959 0005257 195.5960 164.5057 14.21270224558196",
    "category": "weather",
    "description": "Launched in 2014, this Russian weather monitoring satellite significantly enhanced the nation's meteorological capabilities with its modern sensor suite. Meteor-M 2's combination of visible, infrared, and microwave instruments provides comprehensive data on atmospheric conditions, sea surface temperatures, and ice coverage, supporting accurate forecasting across Russia's vast territory while contributing valuable polar observations to the international weather monitoring community.",
    "transponders": {
      "modes": [
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "137.100",
          "beacon": "",
          "mode": "72K LRPT"
        }
      ]
    },
    "image": "/images/satellites/weather/meteorm.jpg",
    "image_source": "https://www.russianspaceweb.com/",
    "country_image": "/images/flags/russia.png"
  },
  {
    "id": "40267U",
    "name": "HIMAWARI-8",
    "tle1": "1 40267U 14060A   25102.77759782 -.00000271  00000+0  00000+0 0  9991",
    "tle2": "2 40267   0.0325  87.3271 0001016 292.9472 241.5335  1.00271775 38545",
    "category": "weather",
    "description": "Launched in 2014, this Japanese meteorological marvel revolutionized weather observation across the Asia-Pacific region with unprecedented imaging capabilities. Himawari-8's advanced imager captures full-disk Earth images every 10 minutes with exceptional resolution and 16 spectral bands, providing stunning visual clarity of typhoons, volcanic eruptions, and other environmental phenomena while dramatically improving forecast accuracy for countries across a third of the globe.",
    "transponders": {},
    "image": "/images/satellites/weather/himawari8.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/japan.png"
  },
  {
    "id": "40367U",
    "name": "FENGYUN 2G",
    "tle1": "1 40367U 14090A   25102.48374319 -.00000294  00000+0  00000+0 0  9997",
    "tle2": "2 40367   4.5454  78.0241 0002011 114.4902 281.9604  1.00267646 37687",
    "category": "weather",
    "description": "Launched in 2014, this Chinese geostationary satellite continued the expansion of the nation's weather monitoring capabilities with enhanced regional coverage. FY-2G's strategic positioning over the Indian Ocean extended China's meteorological reach westward, providing crucial data on weather systems developing over this vital region while supporting the Belt and Road Initiative by offering improved weather services to partner nations across Asia and Africa.",
    "transponders": {},
    "image": "/images/satellites/weather/fengyun2g.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "40732U",
    "name": "METEOSAT-11 (MSG-4)",
    "tle1": "1 40732U 15034A   25102.60866767  .00000068  00000+0  00000+0 0  9997",
    "tle2": "2 40732   2.1252  72.2333 0000879 321.0846  36.1978  1.00277467  2895",
    "category": "weather",
    "description": "Launched in 2015, this European weather watchkeeper represents the culmination of second-generation Meteosat technology after decades of refinement. MSG-4's position over the prime meridian provides crucial coverage of Europe, Africa, and surrounding oceans with 12-channel multispectral imagery every 15 minutes, supporting everything from immediate severe weather warnings to long-term climate studies of this environmentally diverse and populous region.",
    "transponders": {},
    "image": "/images/satellites/weather/meteosat11.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/eu.png"
  },
  {
    "id": "41105U",
    "name": "ELEKTRO-L 2",
    "tle1": "1 41105U 15074A   25102.60397613 -.00000109  00000+0  00000+0 0  9992",
    "tle2": "2 41105   5.6064  75.8082 0002249 238.9899  89.1754  1.00273295 34188",
    "category": "weather",
    "description": "Launched in 2015, this Russian geostationary weather sentinel expanded the nation's monitoring capabilities with its strategic positioning over the Indian Ocean. Elektro-L 2's multispectral imager captures the full Earth disk every 30 minutes, providing crucial data on weather systems affecting Russia and neighboring regions while completing a global network that ensures comprehensive coverage of our planet's dynamic atmospheric conditions.",
    "transponders": {},
    "image": "/images/satellites/weather/elektrol2.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/russia.png"
  },
  {
    "id": "41752U",
    "name": "INSAT-3DR",
    "tle1": "1 41752U 16054A   25102.61570659 -.00000074  00000+0  00000+0 0  9994",
    "tle2": "2 41752   0.1237  88.9074 0011097 188.3121 219.4661  1.00272634 31505",
    "category": "weather",
    "description": "Launched in 2016, this Indian meteorological satellite expanded the nation's weather monitoring capabilities with advanced imaging and atmospheric sounding. INSAT-3DR's diverse instrument package tracks monsoon developments, tropical cyclones, and severe thunderstorms with greater precision, while its specialized Search and Rescue transponder has helped locate and rescue people in distress, making it both a weather forecasting asset and a lifesaving tool.",
    "transponders": {},
    "image": "/images/satellites/weather/insat3dr.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/india.png"
  },
  {
    "id": "41836U",
    "name": "HIMAWARI-9",
    "tle1": "1 41836U 16064A   25102.49199682 -.00000272  00000+0  00000+0 0  9997",
    "tle2": "2 41836   0.0099 181.0006 0001217 224.4701 113.3390  1.00274655 30899",
    "category": "weather",
    "description": "Launched in 2016, this Japanese weather sentinel serves as a critical backup to its twin Himawari-8, ensuring continuous coverage of the Asia-Pacific region. Himawari-9's standby status exemplifies the redundancy built into essential weather monitoring infrastructure, ready to maintain the flow of high-resolution, multi-spectral imagery that protects millions of people from typhoons and other severe weather threats across this densely populated region.",
    "transponders": {},
    "image": "/images/satellites/weather/himawari9.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/japan.png"
  },
  {
    "id": "41866U",
    "name": "GOES 16",
    "tle1": "1 41866U 16071A   25100.54281034 -.00000248  00000+0  00000+0 0  9998",
    "tle2": "2 41866   0.0672 282.3055 0000992 111.8108 284.7074  1.00224673 30760",
    "category": "weather",
    "description": "Launched in 2016, this revolutionary American weather satellite represented a quantum leap in capabilities over its predecessors. GOES-16's advanced imager captures breathtaking full-disk Earth images every 10 minutes at four times the resolution and five times faster than previous technology, while its Geostationary Lightning Mapper tracks lightning strikes in real-time, revolutionizing severe storm prediction and giving forecasters unprecedented tools to protect lives and property.",
    "transponders": {},
    "image": "/images/satellites/weather/goes16.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "41882U",
    "name": "FENGYUN 4A",
    "tle1": "1 41882U 16077A   25067.80059639 -.00000113  00000+0  00000+0 0  9998",
    "tle2": "2 41882   1.1339  85.1667 0004787 173.2627 349.1682  1.00660049 30269",
    "category": "weather",
    "description": "Launched in 2016, this pioneering Chinese satellite inaugurated a new generation of geostationary weather monitoring capabilities. FY-4A's advanced instruments, including the first Chinese geostationary hyperspectral infrared sounder, have dramatically improved the nation's ability to detect and track severe weather phenomena, representing China's growing technological sophistication in space-based Earth observation and meteorological forecasting.",
    "transponders": {},
    "image": "/images/satellites/weather/fengyun4a.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "41884U",
    "name": "CYGFM05",
    "tle1": "1 41884U 16078A   25102.56226423  .00021783  00000+0  55083-3 0  9991",
    "tle2": "2 41884  34.9605 190.0639 0009078  71.7702 288.4004 15.38809694462034",
    "category": "weather",
    "description": "Launched in 2016, this innovative microsatellite is part of a constellation that revolutionized tropical cyclone forecasting with a novel approach. CYGFM05's specialized GPS receiver measures signals reflected off the ocean surface, allowing scientists to determine wind speeds within hurricanes and typhoons even when cloud cover blocks traditional satellite views, dramatically improving intensity forecasts for these dangerous storms.",
    "transponders": {},
    "image": "/images/satellites/weather/cygfm05.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "43013U",
    "name": "NOAA 20 (JPSS-1)",
    "tle1": "1 43013U 17073A   25102.82976787  .00000201  00000+0  11623-3 0  9991",
    "tle2": "2 43013  98.7380  42.1615 0002218  90.6783 269.4647 14.19524185383410",
    "category": "weather",
    "description": "Launched in 2017, this sophisticated polar-orbiting satellite represents the new generation of American weather monitoring technology. NOAA 20's suite of advanced instruments provides unprecedented detail of atmospheric conditions, sea surface temperatures, and polar ice, delivering critical data that has improved weather forecast accuracy by 50% while tracking environmental changes like Arctic ice loss with remarkable precision.",
    "transponders": {
      "modes": [
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "2.248",
          "beacon": "",
          "mode": "FM"
        },
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "2.248",
          "beacon": "",
          "mode": "FM"
        }
      ]
    },
    "image": "/images/satellites/weather/noaa20.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "41888U",
    "name": "CYGFM08",
    "tle1": "1 41888U 16078E   25102.58167055  .00023119  00000+0  56168-3 0  9992",
    "tle2": "2 41888  34.9468 179.0318 0010572  82.5110 277.6810 15.39999264462174",
    "category": "weather",
    "description": "Launched in 2016 as part of an innovative constellation, this microsatellite helped revolutionize tropical cyclone forecasting with creative technology. CYGFM08's ability to measure ocean surface roughness by detecting reflected GPS signals allows meteorologists to determine hurricane wind speeds in regions where traditional aircraft reconnaissance is unavailable, significantly improving intensity predictions for these dangerous storms.",
    "transponders": {},
    "image": "/images/satellites/weather/cygfm08.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "41890U",
    "name": "CYGFM07",
    "tle1": "1 41890U 16078G   25102.54581956  .00023074  00000+0  55163-3 0  9995",
    "tle2": "2 41890  34.9484 169.5939 0008748 101.8147 258.3554 15.40503867462178",
    "category": "weather",
    "description": "Launched in 2016 as part of the CYGNSS constellation, this compact weather observer exemplifies how small satellites can solve big problems. CYGFM07's innovative use of reflected GPS signals to measure wind speeds over oceans has dramatically improved tropical cyclone intensity forecasting, demonstrating how creative engineering approaches can provide crucial data that larger, more expensive satellites miss, especially in the dangerous eyewalls of hurricanes.",
    "transponders": {},
    "image": "/images/satellites/weather/cygfm07.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "41891U",
    "name": "CYGFM03",
    "tle1": "1 41891U 16078H   25102.54306502  .00022595  00000+0  54395-3 0  9991",
    "tle2": "2 41891  34.9438 171.1282 0007540  85.9772 274.1809 15.40307944462305",
    "category": "weather",
    "description": "Launched in 2016 as part of a groundbreaking constellation, this microsatellite demonstrates how innovative thinking can solve stubborn meteorological challenges. CYGFM03's ability to peer through the heavy precipitation of tropical cyclones using reflected GPS signals provides crucial wind data in regions where conventional instruments fail, helping forecasters better predict the strength and development of these dangerous storm systems.",
    "transponders": {},
    "image": "/images/satellites/weather/cygfm03.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "43010U",
    "name": "FENGYUN 3D",
    "tle1": "1 43010U 17072A   25102.87855892  .00000260  00000+0  14462-3 0  9994",
    "tle2": "2 43010  98.9571  66.0186 0001412 156.2195 203.9046 14.19607006383937",
    "category": "weather",
    "description": "Launched in 2017, this advanced Chinese polar-orbiting satellite continues the expansion of the nation's impressive meteorological monitoring capabilities. FY-3D's morning orbit complements afternoon-orbit siblings to provide comprehensive daily coverage, while its cutting-edge instruments support more accurate weather forecasting, environmental monitoring, and climate research, emphasizing China's growing role in international Earth observation cooperation.",
    "transponders": {},
    "image": "/images/satellites/weather/fengyun3d.jpg",
    "image_source": "https://4aspace.fr/",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "43226U",
    "name": "GOES 17",
    "tle1": "1 43226U 18022A   25102.58516983 -.00000089  00000+0  00000+0 0  9991",
    "tle2": "2 43226   0.0315 288.9329 0002208 154.4667 223.8942  1.00272774 26103",
    "category": "weather",
    "description": "Launched in 2018, this sophisticated American weather sentinel maintains a vigilant watch over the western United States and Pacific Ocean. Despite early cooling system challenges that showcased the resilience of aerospace engineering, GOES-17's advanced instruments provide detailed monitoring of wildfires, atmospheric rivers, volcanic eruptions, and other phenomena affecting the western hemisphere, dramatically improving forecast accuracy and emergency response capabilities.",
    "transponders": {},
    "image": "/images/satellites/weather/goes17.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "43491U",
    "name": "FENGYUN 2H",
    "tle1": "1 43491U 18050A   25102.83679103 -.00000124  00000+0  00000+0 0  9998",
    "tle2": "2 43491   1.9212  84.1003 0000348 173.5126 324.2335  1.00273482 25190",
    "category": "weather",
    "description": "Launched in 2018, this Chinese geostationary satellite represents the culmination of the FY-2 series after decades of meteorological mission development. FY-2H's strategic positioning over the Indian Ocean provides crucial coverage of weather patterns affecting Asia and eastern Africa, supporting China's expanding international partnerships while detecting tropical cyclones, monitoring monsoon development, and tracking dust storms across this environmentally dynamic region.",
    "transponders": {},
    "image": "/images/satellites/weather/fengyun2h.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "43689U",
    "name": "METOP-C",
    "tle1": "1 43689U 18087A   25102.78495756  .00000301  00000+0  15726-3 0  9992",
    "tle2": "2 43689  98.6787 163.8948 0000698  25.2726 334.8486 14.21511719333684",
    "category": "weather",
    "description": "Launched in 2018, this European polar-orbiting satellite completed a constellation that has revolutionized global weather forecasting accuracy. MetOp-C's sophisticated instrument suite provides detailed profiles of atmospheric temperature and humidity, tracks atmospheric composition, and monitors sea ice extent, contributing essential data to numerical weather prediction models that have dramatically improved forecast reliability from days to weeks ahead.",
    "transponders": {},
    "image": "/images/satellites/weather/metopc.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/eu.png"
  },
  {
    "id": "43823U",
    "name": "GEO-KOMPSAT-2A",
    "tle1": "1 43823U 18100A   25102.77507829 -.00000340  00000+0  00000+0 0  9991",
    "tle2": "2 43823   0.0151  69.0204 0002318 359.3100 180.1703  1.00269959 23348",
    "category": "weather",
    "description": "Launched in 2018, this sophisticated South Korean satellite represented a major advancement in the nation's meteorological capabilities. GEO-KOMPSAT-2A's advanced imager provides 16 spectral bands of high-resolution imagery covering the Asia-Pacific region every 10 minutes, supporting more accurate forecasting of typhoons, heavy rainfall, and other severe weather events while monitoring air quality, sea surface temperatures, and other environmental parameters vital to South Korea's security and economy.",
    "transponders": {},
    "image": "/images/satellites/weather/geokompsat2a.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/south_korea.png"
  },
  {
    "id": "44387U",
    "name": "METEOR-M2 2",
    "tle1": "1 44387U 19038A   25102.88910362  .00000263  00000+0  13383-3 0  9995",
    "tle2": "2 44387  98.8707  80.0164 0001642 135.2420 224.8891 14.24185094300045",
    "category": "weather",
    "description": "Launched in 2019, this Russian polar-orbiting satellite expanded the nation's weather monitoring capabilities despite early challenges that tested ground controllers' ingenuity. Meteor-M2-2's diverse sensor suite provides comprehensive data on atmospheric conditions, sea surface temperatures, and ice coverage even after surviving a micrometeoroid strike, demonstrating the resilience of modern satellite design while delivering valuable environmental information across Russia's vast and climatically diverse territory.",
    "transponders": {
      "modes": [
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "137.100",
          "beacon": "1700.000",
          "mode": "72K QPSK AHRPT"
        }
      ]
    },
    "image": "/images/satellites/weather/meteorm.jpg",
    "image_source": "https://www.russianspaceweb.com/",
    "country_image": "/images/flags/russia.png"
  },
  {
    "id": "47719U",
    "name": "ARKTIKA-M 1",
    "tle1": "1 47719U 21016A   25102.33071182  .00000091  00000+0  00000+0 0  9991",
    "tle2": "2 47719  63.1418 116.0437 7075419 268.5511  16.8716  2.00606432 30146",
    "category": "weather",
    "description": "Launched in 2021, this pioneering Russian satellite introduced a revolutionary approach to monitoring Earth's polar regions. Arktika-M1's highly elliptical orbit provides persistent coverage of the Arctic with regular 15-30 minute imagery, filling a crucial gap left by geostationary satellites that cannot effectively observe high latitudes, enabling better monitoring of rapidly changing Arctic weather patterns, sea ice dynamics, and climate change impacts.",
    "transponders": {},
    "image": "/images/satellites/weather/arktikam.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/russia.png"
  },
  {
    "id": "49008U",
    "name": "FENGYUN 3E",
    "tle1": "1 49008U 21062A   25102.85206081  .00000058  00000+0  47976-4 0  9991",
    "tle2": "2 49008  98.7433 106.2804 0000631 211.3640 148.7499 14.19857927195511",
    "category": "weather",
    "description": "Launched in 2021, this advanced Chinese meteorological satellite introduced innovative early-morning orbit monitoring to the global weather observation system. FY-3E's dawn-monitoring capability complements existing morning and afternoon orbiters, creating more comprehensive daily coverage of evolving weather systems while its cutting-edge instruments measure everything from atmospheric temperature profiles to soil moisture, enhancing China's contribution to international weather forecasting efforts.",
    "transponders": {},
    "image": "/images/satellites/weather/fengyun3e.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "51850U",
    "name": "GOES 18",
    "tle1": "1 51850U 22021A   25102.57947587  .00000100  00000+0  00000+0 0  9997",
    "tle2": "2 51850   0.0121  29.2125 0000382  61.4631 181.9607  1.00273566 11486",
    "category": "weather",
    "description": "Launched in 2022, this advanced American weather sentinel maintains vigilant watch over the western United States and Pacific Ocean with state-of-the-art capabilities. GOES-18's enhanced imaging system captures detailed views of wildfires, atmospheric rivers, and tropical cyclones, while its Geostationary Lightning Mapper tracks lightning strikes in real-time, providing forecasters with unprecedented tools to predict severe weather development and protect lives and property across the western hemisphere.",
    "transponders": {},
    "image": "/images/satellites/weather/goes18.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "54234U",
    "name": "NOAA 21 (JPSS-2)",
    "tle1": "1 54234U 22150A   25102.58441380  .00000248  00000+0  13826-3 0  9997",
    "tle2": "2 54234  98.7234  42.3097 0001918  27.6237 332.5040 14.19575708125455",
    "category": "weather",
    "description": "Launched in 2022, this sophisticated American polar-orbiting satellite continues the modernization of global weather monitoring capabilities. NOAA 21's advanced instruments provide unprecedented detail of atmospheric conditions, ocean temperatures, and environmental changes with remarkable accuracy, delivering critical data that supports everything from next-day weather forecasts to long-term climate research, while helping meteorologists predict extreme events that threaten lives and property worldwide.",
    "transponders": {
      "modes": [
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "",
          "beacon": "",
          "mode": "Call sign"
        },
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "",
          "beacon": "",
          "mode": "Call sign"
        }
      ]
    },
    "image": "/images/satellites/weather/noaa21.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/usa.png"
  },
  {
    "id": "54743U",
    "name": "METEOSAT-12 (MTG-I1)",
    "tle1": "1 54743U 22170C   25102.39697566 -.00000003  00000+0  00000+0 0  9998",
    "tle2": "2 54743   0.6715  40.1825 0001599 290.0422  13.2621  1.00275428  8650",
    "category": "weather",
    "description": "Launched in 2022, this revolutionary European satellite inaugurated a new generation of weather monitoring capabilities after years of development. MTG-I1's Lightning Imager represents the first operational lightning detection system from geostationary orbit over Europe and Africa, while its 16-channel high-resolution imager captures atmospheric developments every 10 minutes, providing unprecedented tools for detecting and tracking severe storms that threaten lives and property.",
    "transponders": {},
    "image": "/images/satellites/weather/meteosat12.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/eu.png"
  },
  {
    "id": "55973U",
    "name": "TIANMU-1 03",
    "tle1": "1 55973U 23039A   25102.85768773  .00022466  00000+0  69177-3 0  9999",
    "tle2": "2 55973  97.4947 260.4746 0004446 191.2539 168.8605 15.33641038114608",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite forms part of an ambitious constellation focused on real-time tracking and forecasting of tropical cyclones and severe weather. Tianmu-1 03's compact size belies its sophisticated capabilities, with specialized instruments designed to measure atmospheric temperature, humidity, and precipitation, demonstrating China's growing expertise in developing coordinated small satellite networks that complement traditional larger weather monitoring platforms.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu103.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "55974U",
    "name": "TIANMU-1 04",
    "tle1": "1 55974U 23039B   25102.87870741  .00022043  00000+0  67426-3 0  9997",
    "tle2": "2 55974  97.4874 259.8214 0005405 188.9740 171.1407 15.33851537114607",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite exemplifies a modern trend toward using coordinated satellite constellations to enhance weather monitoring capabilities. Tianmu-1 04's specialized instruments work in concert with its constellation partners to provide comprehensive, frequent observations of developing weather systems, particularly focusing on the rapid changes that occur during tropical cyclone formation and intensification across the western Pacific region.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu104.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "55975U",
    "name": "TIANMU-1 05",
    "tle1": "1 55975U 23039C   25102.82648473  .00021775  00000+0  67116-3 0  9995",
    "tle2": "2 55975  97.4920 260.2161 0003807 206.1309 153.9742 15.33618510114584",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite contributes to an innovative weather monitoring network designed to track and forecast severe weather events. Tianmu-1 05's coordinated operations with its constellation partners enable more frequent observations than possible with single satellites, providing crucial data on rapidly developing storm systems and enhancing China's ability to predict and respond to dangerous weather phenomena threatening densely populated coastal regions.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu105.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "55976U",
    "name": "TIANMU-1 06",
    "tle1": "1 55976U 23039D   25102.82713940  .00021875  00000+0  66751-3 0  9993",
    "tle2": "2 55976  97.4934 260.5028 0004243 205.1446 154.9590 15.33934616114592",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite forms part of a sophisticated constellation focused on monitoring and forecasting severe weather events. Tianmu-1 06's combination of compact size and advanced sensors demonstrates a growing trend toward distributed weather monitoring systems, where multiple smaller satellites work in coordination to provide more frequent coverage than possible with individual larger platforms, enhancing prediction capabilities for dangerous storms.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu106.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "57166U",
    "name": "METEOR-M2 3",
    "tle1": "1 57166U 23091A   25102.87494493  .00000079  00000+0  53340-4 0  9992",
    "tle2": "2 57166  98.6671 160.1923 0003655 358.3074   1.8092 14.23991669 93276",
    "category": "weather",
    "description": "Launched in 2023, this advanced Russian meteorological satellite expanded the nation's weather monitoring capabilities with next-generation technology. Meteor-M2-3's diverse sensor suite provides comprehensive data on atmospheric conditions, sea surface temperatures, and ice coverage across Russia's vast territory, from the Baltic to the Pacific, enhancing forecast accuracy while contributing valuable observations of the rapidly changing Arctic region to the international meteorological community.",
    "transponders": {
      "modes": [
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "137.100",
          "beacon": "",
          "mode": "72K"
        }
      ]
    },
    "image": "/images/satellites/weather/meteorm.jpg",
    "image_source": "https://www.russianspaceweb.com/",
    "country_image": "/images/flags/russia.png"
  },
  {
    "id": "57399U",
    "name": "TIANMU-1 07",
    "tle1": "1 57399U 23101A   25102.85400108  .00012249  00000+0  50520-3 0  9998",
    "tle2": "2 57399  97.3169 158.2808 0003955 195.4506 164.6612 15.24193002 95966",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite extends the innovative Tianmu constellation's capabilities for monitoring severe weather systems. Tianmu-1 07's specialized instruments work in coordination with its constellation partners to track rapidly evolving tropical cyclones and monsoon developments, demonstrating China's commitment to enhancing its meteorological capabilities through modern distributed satellite networks that provide more frequent observations than traditional single-satellite approaches.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu107.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "57400U",
    "name": "TIANMU-1 08",
    "tle1": "1 57400U 23101B   25102.82038745  .00012316  00000+0  50772-3 0  9996",
    "tle2": "2 57400  97.3160 158.0841 0005789 208.4679 151.6243 15.24200316 95950",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite contributes to an expanding constellation focused on enhancing severe weather prediction capabilities. Tianmu-1 08's coordination with its constellation partners enables more frequent observations of developing weather systems than possible with individual larger satellites, providing crucial data for meteorologists tracking typhoons, heavy rainfall events, and other dangerous weather phenomena affecting China's densely populated coastal regions.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu108.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "57401U",
    "name": "TIANMU-1 09",
    "tle1": "1 57401U 23101C   25102.86922445  .00012496  00000+0  51417-3 0  9996",
    "tle2": "2 57401  97.3115 157.7964 0005648 204.3005 155.7967 15.24260957 95961",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite extends an innovative constellation approach to weather monitoring and prediction. Tianmu-1 09's compact yet sophisticated instruments work in concert with multiple constellation partners to provide frequent observations of developing weather systems, demonstrating how modern distributed satellite networks can enhance forecasting capabilities by capturing the rapid changes that occur during storm development and intensification.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu109.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "57402U",
    "name": "TIANMU-1 10",
    "tle1": "1 57402U 23101D   25102.83495430  .00013349  35815-7  54722-3 0  9993",
    "tle2": "2 57402  97.3194 158.3577 0007619 207.4601 152.6235 15.24285258 95956",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite forms part of a cutting-edge constellation focused on improving severe weather forecasting capabilities. Tianmu-1 10's collaboration with its constellation partners enables meteorologists to track rapidly evolving storm systems with greater frequency than possible with traditional satellite approaches, enhancing China's ability to predict and respond to dangerous weather phenomena that threaten lives and infrastructure.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu110.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "57490U",
    "name": "FENGYUN 3F",
    "tle1": "1 57490U 23111A   25102.85182280  .00000203  00000+0  11591-3 0  9991",
    "tle2": "2 57490  98.7300 174.6917 0000590  54.1862 305.9369 14.20026355 87793",
    "category": "weather",
    "description": "Launched in 2023, this advanced Chinese polar-orbiting satellite continued the evolution of the nation's meteorological monitoring capabilities. FY-3F's sophisticated instrument suite provides comprehensive data on atmospheric temperature profiles, precipitation patterns, and environmental parameters, enhancing China's contribution to the global weather forecasting network while supporting climate research and disaster monitoring efforts across Asia and beyond.",
    "transponders": {},
    "image": "/images/satellites/weather/fengyun3f.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58584U",
    "name": "ARKTIKA-M 2",
    "tle1": "1 58584U 23198A   25099.57958817  .00000106  00000+0  00000+0 0  9993",
    "tle2": "2 58584  63.2281 201.9048 6882381 269.0768  18.2771  2.00609331  9618",
    "category": "weather",
    "description": "Launched in 2023, this innovative Russian satellite expanded an unprecedented approach to monitoring Earth's rapidly changing polar regions. Arktika-M2's highly elliptical orbit complements its sister satellite by providing alternating coverage of the Arctic, ensuring continuous observation of this climatically crucial region with 15-30 minute imagery, filling the observation gap left by traditional geostationary satellites that cannot effectively monitor high latitudes.",
    "transponders": {},
    "image": "/images/satellites/weather/arktikam.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/russia.png"
  },
  {
    "id": "58645U",
    "name": "TIANMU-1 11",
    "tle1": "1 58645U 23205A   25102.83221001  .00010739  00000+0  48193-3 0  9994",
    "tle2": "2 58645  97.3772 127.0426 0012080  83.1253 277.1357 15.21300168 71973",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite extends the ambitious Tianmu constellation dedicated to enhanced monitoring of severe weather systems. Tianmu-1 11's compact yet sophisticated instruments work in coordination with numerous constellation partners to provide frequent observations of developing tropical cyclones, monsoon patterns, and other significant weather phenomena, demonstrating China's commitment to distributed satellite networks for improved meteorological forecasting.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu111.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58646U",
    "name": "TIANMU-1 12",
    "tle1": "1 58646U 23205B   25102.84873465  .00010888  00000+0  48796-3 0  9997",
    "tle2": "2 58646  97.3759 126.9308 0010131  78.0188 282.2183 15.21359465 71968",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite contributes to an expanding constellation focused on enhancing weather forecasting precision through coordinated observations. Tianmu-1 12's specialized instruments complement its constellation partners by monitoring specific atmospheric parameters, demonstrating how modern distributed satellite networks can provide more frequent updates on developing weather systems than possible with traditional approaches, particularly for fast-evolving phenomena like tropical cyclones.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu112.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58647U",
    "name": "TIANMU-1 13",
    "tle1": "1 58647U 23205C   25102.81397853  .00011661  00000+0  52199-3 0  9999",
    "tle2": "2 58647  97.3787 127.0108 0010070  61.2034 299.0212 15.21384788 71950",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite extends the Tianmu constellation's capabilities for monitoring severe weather systems. Tianmu-1 13's compact yet sophisticated instruments work in coordination with its constellation partners to track rapidly evolving tropical cyclones, monsoon patterns, and other significant weather phenomena, demonstrating China's commitment to distributed satellite networks for improved meteorological forecasting.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu113.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58648U",
    "name": "TIANMU-1 14",
    "tle1": "1 58648U 23205D   25102.86495083  .00011353  00000+0  50847-3 0  9995",
    "tle2": "2 58648  97.3717 126.6321 0010772  63.9780 296.2564 15.21364524 71968",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite contributes to the Tianmu constellation's innovative approach to weather monitoring and prediction. Tianmu-1 14's compact yet sophisticated instruments work in concert with its constellation partners to provide frequent observations of developing weather systems, demonstrating how modern distributed satellite networks can enhance forecasting capabilities by capturing the rapid changes that occur during storm development and intensification.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu114.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58660U",
    "name": "TIANMU-1 19",
    "tle1": "1 58660U 23208A   25102.81580239  .00015055  00000+0  64138-3 0  9996",
    "tle2": "2 58660  97.4215 215.5869 0006296  49.8225 310.3562 15.23041965 71648",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite extends the Tianmu constellation's capabilities for monitoring severe weather systems. Tianmu-1 19's compact yet sophisticated instruments work in coordination with its constellation partners to track rapidly evolving tropical cyclones, monsoon patterns, and other significant weather phenomena, demonstrating China's commitment to distributed satellite networks for improved meteorological forecasting.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu119.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58661U",
    "name": "TIANMU-1 20",
    "tle1": "1 58661U 23208B   25102.79733191  .00016033  00000+0  65839-3 0  9997",
    "tle2": "2 58661  97.4150 215.7785 0008999  55.7900 304.4188 15.24250810 71688",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite contributes to the Tianmu constellation's innovative approach to weather monitoring and prediction. Tianmu-1 20's compact yet sophisticated instruments work in concert with its constellation partners to provide frequent observations of developing weather systems, demonstrating how modern distributed satellite networks can enhance forecasting capabilities by capturing the rapid changes that occur during storm development and intensification.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu120.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58662U",
    "name": "TIANMU-1 21",
    "tle1": "1 58662U 23208C   25102.80227250  .00017740  00000+0  69062-3 0  9992",
    "tle2": "2 58662  97.4192 216.7725 0008459  54.5396 305.6630 15.26023424 71739",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite extends the Tianmu constellation's capabilities for monitoring severe weather systems. Tianmu-1 21's compact yet sophisticated instruments work in coordination with its constellation partners to track rapidly evolving tropical cyclones, monsoon patterns, and other significant weather phenomena, demonstrating China's commitment to distributed satellite networks for improved meteorological forecasting.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu121.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58663U",
    "name": "TIANMU-1 22",
    "tle1": "1 58663U 23208D   25102.80293353  .00014910  00000+0  63447-3 0  9997",
    "tle2": "2 58663  97.4209 215.6803 0005313  73.2198 286.9622 15.23087039 71650",
    "category": "weather",
    "description": "Launched in 2023, this Chinese microsatellite contributes to the Tianmu constellation's innovative approach to weather monitoring and prediction. Tianmu-1 22's compact yet sophisticated instruments work in concert with its constellation partners to provide frequent observations of developing weather systems, demonstrating how modern distributed satellite networks can enhance forecasting capabilities by capturing the rapid changes that occur during storm development and intensification.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu122.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58700U",
    "name": "TIANMU-1 15",
    "tle1": "1 58700U 24004A   25102.59765919  .00011294  00000+0  50481-3 0  9998",
    "tle2": "2 58700  97.4647 285.6023 0008791  83.9241 276.2996 15.21457445 70193",
    "category": "weather",
    "description": "Launched in 2024, this Chinese microsatellite extends the Tianmu constellation's capabilities for monitoring severe weather systems. Tianmu-1 15's compact yet sophisticated instruments work in coordination with its constellation partners to track rapidly evolving tropical cyclones, monsoon patterns, and other significant weather phenomena, demonstrating China's commitment to distributed satellite networks for improved meteorological forecasting.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu115.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58701U",
    "name": "TIANMU-1 16",
    "tle1": "1 58701U 24004B   25102.84539605  .00012759  00000+0  57004-3 0  9993",
    "tle2": "2 58701  97.4581 285.4448 0009131  85.5473 274.6806 15.21439355 70231",
    "category": "weather",
    "description": "Launched in 2024, this Chinese microsatellite contributes to the Tianmu constellation's innovative approach to weather monitoring and prediction. Tianmu-1 16's compact yet sophisticated instruments work in concert with its constellation partners to provide frequent observations of developing weather systems, demonstrating how modern distributed satellite networks can enhance forecasting capabilities by capturing the rapid changes that occur during storm development and intensification.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu116.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58702U",
    "name": "TIANMU-1 17",
    "tle1": "1 58702U 24004C   25102.83521433  .00012105  00000+0  54262-3 0  9991",
    "tle2": "2 58702  97.4621 285.7155 0007045  82.3255 277.8780 15.21351912 70227",
    "category": "weather",
    "description": "Launched in 2024, this Chinese microsatellite extends the Tianmu constellation's capabilities for monitoring severe weather systems. Tianmu-1 17's compact yet sophisticated instruments work in coordination with its constellation partners to track rapidly evolving tropical cyclones, monsoon patterns, and other significant weather phenomena, demonstrating China's commitment to distributed satellite networks for improved meteorological forecasting.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu117.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58703U",
    "name": "TIANMU-1 18",
    "tle1": "1 58703U 24004D   25102.81387262  .00011478  00000+0  51436-3 0  9992",
    "tle2": "2 58703  97.4637 285.8431 0007115  75.3200 284.8824 15.21376530 70223",
    "category": "weather",
    "description": "Launched in 2024, this Chinese microsatellite contributes to the Tianmu constellation's innovative approach to weather monitoring and prediction. Tianmu-1 18's compact yet sophisticated instruments work in concert with its constellation partners to provide frequent observations of developing weather systems, demonstrating how modern distributed satellite networks can enhance forecasting capabilities by capturing the rapid changes that occur during storm development and intensification.",
    "transponders": {},
    "image": "/images/satellites/weather/tianmu118.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/china.png"
  },
  {
    "id": "58990U",
    "name": "INSAT-3DS",
    "tle1": "1 58990U 24033A   25102.55176104 -.00000153  00000+0  00000+0 0  9990",
    "tle2": "2 58990   0.0606  87.6376 0001733 291.5199 102.5499  1.00273085 42756",
    "category": "weather",
    "description": "Launched in 2024, this Indian meteorological satellite expands the nation's weather monitoring capabilities with advanced imaging and atmospheric sounding. INSAT-3DS's diverse instrument package tracks monsoon developments, tropical cyclones, and severe thunderstorms with greater precision, while its specialized Search and Rescue transponder has helped locate and rescue people in distress, making it both a weather forecasting asset and a lifesaving tool.",
    "transponders": {},
    "image": "/images/satellites/weather/insat3ds.jpg",
    "image_source": "https://wikipedia.org",
    "country_image": "/images/flags/india.png"
  },
  {
    "id": "59051U",
    "name": "METEOR-M2 4",
    "tle1": "1 59051U 24039A   25102.89069438  .00000118  00000+0  72352-4 0  9997",
    "tle2": "2 59051  98.6442  64.1173 0006760 345.5731  14.5253 14.22356674 58096",
    "category": "weather",
    "description": "Launched in 2024, this advanced Russian meteorological satellite expanded the nation's weather monitoring capabilities with next-generation technology. Meteor-M2-4's diverse sensor suite provides comprehensive data on atmospheric conditions, sea surface temperatures, and ice coverage across Russia's vast territory, from the Baltic to the Pacific, enhancing forecast accuracy while contributing valuable observations of the rapidly changing Arctic region to the international meteorological community.",
    "transponders": {
      "modes": [
        {
          "status": "inactive",
          "uplink": "",
          "downlink": "137.100",
          "beacon": "",
          "mode": "72K LRPT HRPT"
        }
      ]
    },
    "image": "/images/satellites/weather/meteorm.jpg",
    "image_source": "https://www.russianspaceweb.com/",
    "country_image": "/images/flags/russia.png"
  }
]